# Pandas IO

## Criando os nomes

In [1]:
import pandas as pd # noqa E402

In [6]:
nomes_m = pd.read_json(
    'https://servicodados.ibge.gov.br/api/v1/censos/nomes/\
        ranking?qtd=200&sexo=m'
)

nomes_f = pd.read_json(
    'https://servicodados.ibge.gov.br/api/v1/censos/nomes/\
        ranking?qtd=200&sexo=f'
)

In [8]:
nomes_m.head()

        nome  regiao     freq  rank sexo
0       JOSE       0  5732508     1    M
1       JOAO       0  2971935     2    M
2    ANTONIO       0  2567494     3    M
3  FRANCISCO       0  1765197     4    M
4     CARLOS       0  1483121     5    M

In [9]:
nomes_f.head()

        nome  regiao      freq  rank sexo
0      MARIA       0  11694738     1    F
1        ANA       0   3079729     2    F
2  FRANCISCA       0    721637     3    F
3    ANTONIA       0    588783     4    F
4    ADRIANA       0    565621     5    F

In [11]:
print(f'Quantidade de nomes: {len(nomes_m) + len(nomes_f)}')

Quantidade de nomes: 400

In [24]:
frames = [nomes_m, nomes_f]

In [37]:
type(pd.concat(frames)['nome'])

pandas.core.series.Series

In [32]:
nomes = pd.concat(frames)['nome'].to_frame()

In [33]:
nomes

          nome
0         JOSE
1         JOAO
2      ANTONIO
3    FRANCISCO
4       CARLOS
..         ...
195     ROSANE
196    IVONETE
197    LUCIANE
198    ISADORA
199      NILZA

[400 rows x 1 columns]

In [36]:
nomes = nomes.sample(nomes.shape[0])
nomes.reset_index(drop=True, inplace=True)
nomes

         nome
0      WILIAN
1       NILZA
2    ANDERSON
3      ISMAEL
4     EMERSON
..        ...
395  RAIMUNDO
396   CLAUDIA
397    WILSON
398    ALVARO
399     JOANA

[400 rows x 1 columns]

## incluindo ID dos alunos

In [38]:
import numpy as np # noqa E402
np.random.seed(123)

In [39]:
total_alunos = nomes.shape[0]
total_alunos

400

In [41]:
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [42]:
nomes.sample(5)

        nome  id_aluno
188  LARISSA       369
57      HUGO       303
203    JAIRO       382
382   SILVIA        33
230  ANTONIO       111

In [43]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [44]:
nomes

         nome  id_aluno                 dominio
0      WILIAN       235  @dominiodoemail.com.br
1       NILZA        43     @servicodoemail.com
2    ANDERSON       304     @servicodoemail.com
3      ISMAEL       156  @dominiodoemail.com.br
4     EMERSON       343     @servicodoemail.com
..        ...       ...                     ...
395  RAIMUNDO       231  @dominiodoemail.com.br
396   CLAUDIA        99     @servicodoemail.com
397    WILSON       323  @dominiodoemail.com.br
398    ALVARO       383  @dominiodoemail.com.br
399     JOANA       366     @servicodoemail.com

[400 rows x 3 columns]

In [46]:
nomes['email'] = nomes['nome'].str.cat(nomes.dominio).str.lower()
nomes

,nome,id_aluno,dominio,email
0,WILIAN,235,@dominiodoemail.com.br,wilian@dominiodoemail.com.br
1,NILZA,43,@servicodoemail.com,nilza@servicodoemail.com
2,ANDERSON,304,@servicodoemail.com,anderson@servicodoemail.com
3,ISMAEL,156,@dominiodoemail.com.br,ismael@dominiodoemail.com.br
4,EMERSON,343,@servicodoemail.com,emerson@servicodoemail.com
...,...,...,...,...
395,RAIMUNDO,231,@dominiodoemail.com.br,raimundo@dominiodoemail.com.br
396,CLAUDIA,99,@servicodoemail.com,claudia@servicodoemail.com
397,WILSON,323,@dominiodoemail.com.br,wilson@dominiodoemail.com.br
398,ALVARO,383,@dominiodoemail.com.br,alvaro@dominiodoemail.com.br
399,JOANA,366,@servicodoemail.com,joana@servicodoemail.com

In [47]:
type(np.random)

module